       IDENTIFICATION DIVISION.
       PROGRAM-ID. LNUTIL01.
       PROCEDURE DIVISION.
           DISPLAY "--- ZBRIDGE-ORCHESTRATOR START ---".
           GOBACK.