//DEFVSAM  JOB (ACCT),'ZBRIDGE',CLASS=A,MSGCLASS=X
//*
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  DELETE Z88264.ZBRIDGE.MASTER.KSDS
  SET MAXCC = 0

  DEFINE CLUSTER (NAME(Z88264.ZBRIDGE.MASTER.KSDS) -
         INDEXED -
         KEYS(10 0) -
         RECORDSIZE(80 80) -
         TRACKS(1 1)) -
         DATA (NAME(Z88264.ZBRIDGE.MASTER.KSDS.DATA)) -
         INDEX (NAME(Z88264.ZBRIDGE.MASTER.KSDS.INDEX))
/*