//SEARCH   JOB (ACCT),'FIND COBOL',MSGCLASS=H,CLASS=A
//STEP1    EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  LISTCAT LEVEL(IGY)
  LISTCAT LEVEL(COBOL)
/*