//COMPUTIL JOB (ACCT),'COMP STATIC',CLASS=A,MSGCLASS=X
//  SET HLQ='Z88264.AZBRIDGE'
//  SET PGM='LNUTIL01'
//*
//* USE IGYWC (COMPILE ONLY) - NO BINDER STEP
//ST1      EXEC IGYWC,PARM.COBOL='APOST,NODYNAM'
//COBOL.SYSIN   DD DSN=&HLQ..SUBSRC(&PGM),DISP=SHR
//* SYSLIN DEFINES WHERE THE OBJECT MODULE GOES (FB IS OK HERE)
//COBOL.SYSLIN  DD DSN=&HLQ..OBJLIB(&PGM),DISP=SHR
//COBOL.SYSPRINT DD SYSOUT=*