//COMPDYN JOB (ACCT),'COMP DYNAMIC',CLASS=A,MSGCLASS=X
//  SET HLQ='Z88264.AZBRIDGE'
//  SET PGM='LNCALC01'
//ST1 EXEC IGYWCL,PARM.COBOL='LIB,APOST,DYNAM'
//COBOL.SYSIN  DD DSN=&HLQ..SUBSRC(&PGM),DISP=SHR
//COBOL.SYSLIB DD DSN=&HLQ..COPYLIB,DISP=SHR
//LKED.SYSLMOD DD DSN=&HLQ..LOADLIB(&PGM),DISP=SHR