//REPROJOB JOB (ACCT),'LOAD TO VSAM',CLASS=A,MSGCLASS=X
//  SET HLQ='{{ hlq }}.{{ app_prefix }}'         
//STEP01   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO REPLACE -
    INDATASET(&HLQ...TRANS) -
    OUTDATASET(&HLQ...MASTER)
/*