//REPROJOB JOB (ACCT),'LOAD TO VSAM',CLASS=A,MSGCLASS=X
//STEP01   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  REPRO REPLACE -
    INDATASET(Z88264.AZBRIDGE.TRANS) -
    OUTDATASET(Z88264.AZBRIDGE.MASTER)
/*