//PRNTVASM JOB (ACCT),'PRINT VSAM',CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//STEP01   EXEC PGM=IDCAMS
//SYSPRINT DD SYSOUT=*
//SYSIN    DD *
  PRINT INDATASET({{ datasets.master }}) -
  CHARACTER
/*